app/Controllers/Home.php

    public function index()
    {
        $stats = [
            'talleres'  => (new TallerModel())->countAllResults(),
            'vehiculos' => (new VehiculoModel())->countAllResults(),
            'ordenes'   => (new OrdenModel())->countAllResults(),
            'repuestos' => (new RepuestoModel())->countAllResults(),
        ];

        $ultimas_ordenes = (new OrdenModel())
            ->select('ordenes.*, vehiculos.placa')
            ->join('vehiculos', 'vehiculos.id = ordenes.vehiculo_id', 'left')
            ->orderBy('ordenes.id', 'DESC')
            ->limit(5)
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `talleres`
SELECT COUNT(*) AS `numrows`
FROM `vehiculos`
SELECT COUNT(*) AS `numrows`
FROM `ordenes`
SELECT COUNT(*) AS `numrows`
FROM `repuestos`
SELECT `ordenes`.*, `vehiculos`.`placa`
FROM `ordenes`
LEFT JOIN `vehiculos` ON `vehiculos`.`id` = `ordenes`.`vehiculo_id`
ORDER BY `ordenes`.`id` DESC
 LIMIT 5