app/Controllers/Orden.php

    public function index()
    {
        $model = new OrdenModel();
        $datos = $model
            ->select('ordenes.*, vehiculos.placa')
            ->join('vehiculos', 'vehiculos.id = ordenes.vehiculo_id', 'left')
            ->orderBy('ordenes.id', 'DESC')
            ->findAll();
---
SELECT `ordenes`.*, `vehiculos`.`placa`
FROM `ordenes`
LEFT JOIN `vehiculos` ON `vehiculos`.`id` = `ordenes`.`vehiculo_id`
ORDER BY `ordenes`.`id` DESC

    public function nuevo()
    {
        $vehiculoModel = new VehiculoModel();
        $repuestoModel = new RepuestoModel();

        return view('orden/nuevo', [
            'vehiculos' => $vehiculoModel->findAll(),
            'repuestos' => $repuestoModel->findAll()
        ]);
---
SELECT *
FROM `vehiculos`
SELECT *
FROM `repuestos`