app/Controllers/Repuesto.php

SELECT *
FROM `repuestos`
---
    public function index()
    {
        $model = new RepuestoModel();

        $data = array(
            'datos' => $model->findAll()
        );