app/Controllers/Vehiculo.php

    public function deku()
    {
        $model = new VehiculoModel();

        $datos = $model
            ->select('vehiculos.*, talleres.nombre as taller_nombre')
            ->join('talleres', 'talleres.id = vehiculos.taller_id', 'left')
            ->findAll();
---
SELECT `vehiculos`.*, `talleres`.`nombre` as `taller_nombre`
FROM `vehiculos`
LEFT JOIN `talleres` ON `talleres`.`id` = `vehiculos`.`taller_id`

    public function guardar()
    {
        $model = new VehiculoModel();

        $data = array(
            'taller_id' => $this->request->getPost('taller_id'),
            'placa' => $this->request->getPost('placa'),
            'marca' => $this->request->getPost('marca'),
            'modelo' => $this->request->getPost('modelo'),
            'anio' => $this->request->getPost('anio'),
            'tipo_servicio' => $this->request->getPost('tipo_servicio')
        );

        $model->insert($data);
---
INSERT INTO `vehiculos` (`taller_id`, `placa`, `marca`, `modelo`, `anio`, `tipo_servicio`) VALUES ('1', 'abd078r', 'Ford', 'shellvy', '2015', 'Mantenimiento')